In [1]:
# Bibliotecas
import pandas as pd
import folium

In [2]:
!pip show folium

Name: folium
Version: 0.14.0
Summary: Make beautiful maps with Leaflet.js & Python
Home-page: https://github.com/python-visualization/folium
Author: Rob Story
Author-email: wrobstory@gmail.com
License: MIT
Location: c:\users\lui-m\anaconda3\lib\site-packages
Requires: branca, jinja2, numpy, requests
Required-by: streamlit-folium

WARNING: Ignoring invalid distribution -treamlit (c:\users\lui-m\anaconda3\lib\site-packages)

In [3]:
# Importando Dataset
df_root = pd.read_csv('dataset/clean_zomato.csv')

# Fazendo cópia do dataframe lido
df = df_root.copy()
df.head()

,restaurant_id,restaurant_name,country_name,city,address,locality,longitude,latitude,cuisines,average_cost_for_two,currency,has_table_booking,has_online_delivery,is_delivering_now,price_range,aggregate_rating,rating_color,rating_text,votes
0,6310675,Mama Lou's Italian Kitchen,Philippines,Las Piñas City,"Block 1, Lot 36, Tropical Avenue Corner Tropic...",BF International,121.009787,14.447615,Italian,1100,Botswana Pula(P),1,0,0,expensive,4.6,darkgreen,Excellent,619
1,6314542,Blackbird,Philippines,Makati City,"Nielson Tower, Ayala Triangle Gardens, Salcedo...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.024562,14.556042,European,3100,Botswana Pula(P),0,0,0,gourmet,4.7,darkgreen,Excellent,469
2,6301293,Banapple,Philippines,Makati City,"Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.023171,14.556196,Filipino,800,Botswana Pula(P),0,0,0,expensive,4.4,green,Very Good,867
3,6315689,Bad Bird,Philippines,Makati City,"Hole In The Wall, Floor 4, Century City Mall, ...","Century City Mall, Poblacion, Makati City",121.027708,14.565899,American,700,Botswana Pula(P),0,0,0,expensive,4.4,green,Very Good,858
4,6304833,Manam,Philippines,Makati City,"Level 1, Greenbelt 2, Ayala Center, Greenbelt,...","Greenbelt 2, San Lorenzo, Makati City",121.020380,14.552351,Filipino,700,Botswana Pula(P),0,0,0,expensive,4.7,darkgreen,Excellent,930

In [4]:
df.shape

(6927, 19)

# Fome 0 - Geral

## 01 - Quantos restaurantes únicos estão registrados?

In [5]:
restaurantes_unicos = df['restaurant_id'].nunique()
print(f'São {restaurantes_unicos} restaurantes únicos registrados')

São 6927 restaurantes únicos registrados

## 02 - Quantos países únicos estão registrados?

In [6]:
paises_unicos = df['country_name'].nunique()
print(f'São {paises_unicos} países únicos registrados')

São 15 países únicos registrados

## 03 - Quantas cidades únicas estão registradas?

In [7]:
cidades_unicas = df['city'].nunique()
print(f'São {cidades_unicas} cidades únicas registrados')

São 125 cidades únicas registrados

## 04 - Qual o total de avaliações feitas?

In [8]:
soma_avaliacoes = df['votes'].sum()
print(f'Foram {soma_avaliacoes} avaliações realizadas')

Foram 4194530 avaliações realizadas

## 05 - Qual o total de tipos de culinária registrados?

In [9]:
tipos_culinaria = df['cuisines'].nunique()
print(f'São {tipos_culinaria} tipos de culinária registrados')

São 163 tipos de culinária registrados

# Fome Zero - País

## 01 -  Qual o nome do país que possui mais cidades registradas?

In [10]:
# Pegando os valores únicos de cidades por países
cidades_por_pais = df.loc[:, ['country_name', 'city']].groupby('country_name').nunique().sort_values(by='city').reset_index()
print(f'O pais que mais possui cidades registrada é: {cidades_por_pais.iloc[-1,0]}')
cidades_por_pais

O pais que mais possui cidades registrada é: India

                country_name  city
0                      Qatar     1
1                  Singapure     1
2                  Sri Lanka     1
3                     Turkey     2
4                  Australia     3
5                     Brazil     3
6                     Canada     3
7                  Indonesia     3
8                 New Zeland     4
9       United Arab Emirates     4
10                   England     5
11               Philippines    12
12              South Africa    12
13  United States of America    22
14                     India    49

## 02 - Qual o nome do país que possui mais restaurantes registrados?

In [11]:
# Valores únicos de restaurantes por países
restaurantes_por_pais = df.loc[:, ['country_name', 'restaurant_id']].groupby('country_name').nunique().sort_values(by='restaurant_id').reset_index()
print(f'O pais que mais possui restaurantes registrados é: {restaurantes_por_pais.iloc[-1,0]}')
restaurantes_por_pais

O pais que mais possui restaurantes registrados é: India

                country_name  restaurant_id
0                  Indonesia             80
1                Philippines             80
2                      Qatar             80
3                  Singapure             80
4                  Sri Lanka             80
5                     Turkey            159
6                  Australia            180
7                     Canada            180
8                     Brazil            239
9                 New Zeland            239
10      United Arab Emirates            300
11              South Africa            345
12                   England            400
13  United States of America           1374
14                     India           3111

## 03 - Qual o nome do país que possui mais restaurantes com o nível de preço igual a 4 registrados?

In [12]:
cols = ['country_name', 'restaurant_id']
restaurantes_nivel4 = df.loc[df['price_range'] == 'gourmet', cols].groupby('country_name').count().sort_values(by='restaurant_id').reset_index()
print(f'O pais que mais possui restaurantes com nível gourmet é: {restaurantes_nivel4.iloc[-1,0]}')
restaurantes_nivel4

O pais que mais possui restaurantes com nível gourmet é: United States of America

                country_name  restaurant_id
0                  Sri Lanka             16
1                  Indonesia             17
2                Philippines             23
3                  Australia             33
4                      Qatar             50
5                     Canada             54
6                  Singapure             58
7                     Turkey             59
8                    England             79
9                 New Zeland             79
10      United Arab Emirates            102
11                    Brazil            148
12                     India            195
13              South Africa            220
14  United States of America            415

## 04 - Qual o nome do país que possui a maior quantidade de tipos de culinária distintos?

In [13]:
cols = ['country_name', 'cuisines']
paises_tipos_culinaria = df.loc[:, cols].groupby('country_name').nunique().sort_values(by='cuisines').reset_index()
print(f'O pais que possui a maior quantidade de tipos de culinária é: {paises_tipos_culinaria.iloc[-1,0]}')
paises_tipos_culinaria

O pais que possui a maior quantidade de tipos de culinária é: India

                country_name  cuisines
0                Philippines        14
1                  Indonesia        21
2                  Singapure        21
3                  Sri Lanka        26
4                     Turkey        28
5                      Qatar        31
6                 New Zeland        37
7               South Africa        41
8                     Brazil        42
9                     Canada        42
10                 Australia        43
11      United Arab Emirates        46
12                   England        52
13  United States of America        74
14                     India        77

## 05 -  Qual o nome do país que possui a maior quantidade de avaliações feitas?

In [14]:
avaliacoes_por_pais = df.loc[:, ['country_name', 'votes']].groupby('country_name').sum().sort_values(by='votes').reset_index()
print(f'O pais que possui a maior quantidade de avaliacões é: {avaliacoes_por_pais.iloc[-1,0]}')
avaliacoes_por_pais

O pais que possui a maior quantidade de avaliacões é: India

                country_name    votes
0                  Singapure     1822
1                     Brazil     2976
2                  Sri Lanka    12133
3                      Qatar    30106
4                    England    39956
5                Philippines    48398
6                 New Zeland    52532
7               South Africa    81937
8                  Indonesia    89026
9                     Turkey   100193
10                    Canada   105018
11                 Australia   130357
12      United Arab Emirates   177564
13  United States of America   522348
14                     India  2800164

## 06 - Qual o nome do país que possui a maior quantidade de restaurantes que fazem entrega?

In [15]:
cols = ['country_name', 'is_delivering_now']
pais_entregas = df.loc[df['is_delivering_now'] == 1, cols].groupby('country_name').count().sort_values(by='is_delivering_now').reset_index()
print(f'O pais que possui a maior quantidade de restaurantes que fazem entrega é: {pais_entregas.iloc[-1,0]}')
pais_entregas

O pais que possui a maior quantidade de restaurantes que fazem entrega é: India

           country_name  is_delivering_now
0                 Qatar                  3
1           Philippines                  7
2  United Arab Emirates                 52
3                 India               1150

## 07 - Qual o nome do país que possui a maior quantidade de restaurantes que aceitam reservas?

In [16]:
cols = ['country_name', 'has_table_booking']
pais_reservas = df.loc[df['has_table_booking'] == 1, cols].groupby('country_name').count().sort_values(by='has_table_booking').reset_index()
print(f'O pais que possui a maior quantidade de restaurantes que fazem reserva é: {pais_reservas.iloc[-1,0]}')
pais_reservas

O pais que possui a maior quantidade de restaurantes que fazem reserva é: India

                country_name  has_table_booking
0                  Sri Lanka                  1
1               South Africa                  3
2   United States of America                  3
3                      Qatar                  4
4                     Turkey                  4
5       United Arab Emirates                 10
6                  Indonesia                 14
7                 New Zeland                 19
8                Philippines                 22
9                  Australia                 29
10                   England                 55
11                     India                256

## 08 - Qual o nome do país que possui, na média, a maior quantidade de avaliações registrada?

In [17]:
avaliacoes_medias_por_pais = df.loc[:, ['country_name', 'votes']].groupby('country_name').mean().sort_values(by='votes').reset_index()
print(f'O pais que possui a maior quantidade de avaliacões é: {avaliacoes_medias_por_pais.iloc[-1,0]}')
avaliacoes_medias_por_pais

O pais que possui a maior quantidade de avaliacões é: Indonesia

                country_name        votes
0                     Brazil    12.451883
1                  Singapure    22.775000
2                    England    99.890000
3                  Sri Lanka   151.662500
4                 New Zeland   219.799163
5               South Africa   237.498551
6                      Qatar   376.325000
7   United States of America   380.165939
8                     Canada   583.433333
9       United Arab Emirates   591.880000
10               Philippines   604.975000
11                    Turkey   630.144654
12                 Australia   724.205556
13                     India   900.084860
14                 Indonesia  1112.825000

## 09 - Qual o nome do país que possui, na média, a maior nota média registrada?

In [18]:
nota_media_por_pais = df.loc[:, ['country_name', 'aggregate_rating']].groupby('country_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O pais que possui, na média, a maior nota média registrada é: {nota_media_por_pais.iloc[-1,0]}')
nota_media_por_pais

O pais que possui, na média, a maior nota média registrada é: Indonesia

                country_name  aggregate_rating
0                     Brazil          3.335565
1       United Arab Emirates          4.023667
2                      India          4.037126
3                    England          4.041750
4                  Sri Lanka          4.057500
5               South Africa          4.073333
6                 New Zeland          4.164435
7                      Qatar          4.240000
8                     Turkey          4.310063
9                     Canada          4.321667
10                 Australia          4.372778
11  United States of America          4.402693
12                 Singapure          4.435000
13               Philippines          4.463750
14                 Indonesia          4.601250

## 10 - Qual o nome do país que possui, na média, a menor nota média registrada?

In [19]:
nota_media_por_pais = df.loc[:, ['country_name', 'aggregate_rating']].groupby('country_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O pais que possui, na média, a menor nota média registrada é: {nota_media_por_pais.iloc[0,0]}')
nota_media_por_pais

O pais que possui, na média, a menor nota média registrada é: Brazil

                country_name  aggregate_rating
0                     Brazil          3.335565
1       United Arab Emirates          4.023667
2                      India          4.037126
3                    England          4.041750
4                  Sri Lanka          4.057500
5               South Africa          4.073333
6                 New Zeland          4.164435
7                      Qatar          4.240000
8                     Turkey          4.310063
9                     Canada          4.321667
10                 Australia          4.372778
11  United States of America          4.402693
12                 Singapure          4.435000
13               Philippines          4.463750
14                 Indonesia          4.601250

## 11 -  Qual a média de preço de um prato para dois por país?

In [20]:
media_preco2_pais = df.loc[:, ['country_name', 'average_cost_for_two']].groupby('country_name').mean().sort_values(by='average_cost_for_two').reset_index()
media_preco2_pais

                country_name  average_cost_for_two
0                     Canada             41.861111
1                    England             43.510000
2   United States of America             55.029840
3                 New Zeland             62.154812
4                     Turkey            128.584906
5                     Brazil            139.393305
6                  Singapure            141.437500
7       United Arab Emirates            153.716667
8                      Qatar            174.000000
9               South Africa            339.515942
10                     India            704.400514
11               Philippines           1227.825000
12                 Sri Lanka           2579.375000
13                 Australia         138959.783333
14                 Indonesia         303000.000000

# Fome Zero - Cidade

## 01 -  Qual o nome da cidade que possui mais restaurantes registrados?

In [21]:
restaurantes_por_cidade = df.loc[:, ['city', 'restaurant_id']].groupby('city').nunique().sort_values(by='restaurant_id').reset_index()

# Perguntar na monitoria como fazer esse corte
print(f'A cidade de {restaurantes_por_cidade.iloc[-1,0]}')
restaurantes_por_cidade

A cidade de Ludhiana

                   city  restaurant_id
0            Roodepoort              1
1         Marikina City              1
2         San Juan City              1
3        Las Piñas City              1
4    Johannesburg South              1
..                  ...            ...
120                 Goa             80
121             Glasgow             80
122           Edinburgh             80
123              Jaipur             80
124            Ludhiana             80

[125 rows x 2 columns]

In [22]:
df_aux = df.loc[:, ['country_name', 'average_cost_for_two']].groupby('country_name').mean().sort_values(by='average_cost_for_two', ascending = False).reset_index()
df_aux

                country_name  average_cost_for_two
0                  Indonesia         303000.000000
1                  Australia         138959.783333
2                  Sri Lanka           2579.375000
3                Philippines           1227.825000
4                      India            704.400514
5               South Africa            339.515942
6                      Qatar            174.000000
7       United Arab Emirates            153.716667
8                  Singapure            141.437500
9                     Brazil            139.393305
10                    Turkey            128.584906
11                New Zeland             62.154812
12  United States of America             55.029840
13                   England             43.510000
14                    Canada             41.861111

## 02 - Qual o nome da cidade que possui mais restaurantes com nota média acima de 4?

In [23]:
restaurantes_gourmet_por_cidade = df.loc[df['aggregate_rating'] > 4, ['city', 'restaurant_id']].groupby('city').nunique().sort_values(by='restaurant_id').reset_index()
print(f'A cidade que possui mais restaurantes com nota média acima de 4 é {restaurantes_gourmet_por_cidade.iloc[-1,0]}')
restaurantes_gourmet_por_cidade

A cidade que possui mais restaurantes com nota média acima de 4 é Bangalore

                   city  restaurant_id
0             Ghaziabad              1
1                Shimla              1
2    Johannesburg South              1
3        Las Piñas City              1
4         San Juan City              1
..                  ...            ...
116             Chennai             72
117             Jakarta             74
118             Houston             75
119              London             78
120           Bangalore             79

[121 rows x 2 columns]

## 03 - Qual o nome da cidade que possui mais restaurantes com nota média abaixo de 2.5?

In [24]:
rest_nota_baixa_por_cidade = df.loc[df['aggregate_rating'] < 2.5, ['city', 'restaurant_id']].groupby('city').nunique().sort_values(by='restaurant_id').reset_index()
print(f'A cidade que possui mais restaurantes com nota média acima de 4 é {rest_nota_baixa_por_cidade.iloc[-1,0]}')
rest_nota_baixa_por_cidade

A cidade que possui mais restaurantes com nota média acima de 4 é Gangtok

              city  restaurant_id
0           Ankara              1
1          Colombo              1
2           Durban              1
3         Pretoria              1
4           Nashik              1
5            Perth              1
6       Puducherry              2
7        Edinburgh              2
8         Hamilton              2
9          Clarens              3
10          Shimla              4
11      Manchester              7
12  Rio de Janeiro             12
13        Brasília             15
14       São Paulo             15
15            Ooty             19
16         Gangtok             33

## 04 -  Qual o nome da cidade que possui o maior valor médio de um prato para dois?

In [25]:
df_aux = df.loc[:, ['city', 'average_cost_for_two']].groupby('city').mean().sort_values(by='average_cost_for_two').reset_index()
print(f'A cidade que possui o maior valor médio de um prato para 2 {df_aux.iloc[-1,0]}')
df_aux

A cidade que possui o maior valor médio de um prato para 2 Adelaide

            city  average_cost_for_two
0        Detroit             25.750000
1        Phoenix             28.000000
2         Denver             29.916667
3    Los Angeles             30.000000
4        Calgary             32.500000
..           ...                   ...
120   Pasay City           4000.000000
121        Bogor         175000.000000
122    Tangerang         180000.000000
123      Jakarta         309605.263158
124     Adelaide         416734.133333

[125 rows x 2 columns]

## 05 - Qual o nome da cidade que possui a maior quantidade de tipos de culinária distintas?

In [26]:
df_aux = df.loc[:, ['city', 'cuisines']].groupby('city').nunique().sort_values(by='cuisines').reset_index()
print(f'A cidade que possui a maior quantidade de tipos de culinária distintas é {df_aux.iloc[-1,0]}')
df_aux

A cidade que possui a maior quantidade de tipos de culinária distintas é Birmingham

                city  cuisines
0        Gandhinagar         1
1    Muntinlupa City         1
2           Zirakpur         1
3      Marikina City         1
4         Roodepoort         1
..               ...       ...
120          Houston        30
121       Manchester        30
122         Montreal        30
123             Doha        31
124       Birmingham        32

[125 rows x 2 columns]

## 06 - Qual o nome da cidade que possui a maior quantidade de restaurantes que fazem reservas?

In [27]:
df_aux = df.loc[df['has_table_booking'] == 1, ['city', 'restaurant_id']].groupby('city').nunique().sort_values(by='restaurant_id').reset_index()
print(f'A cidade que possui a maior quantidade de restaurantes que fazem reservas é: {df_aux.iloc[-1,0]}')
df_aux

A cidade que possui a maior quantidade de restaurantes que fazem reservas é: Bangalore

            city  restaurant_id
0   Johannesburg              1
1        Colombo              1
2     Coimbatore              1
3          Patna              1
4         Ranchi              1
..           ...            ...
64      Brisbane             17
65        Mumbai             18
66          Pune             25
67       Chennai             28
68     Bangalore             42

[69 rows x 2 columns]

## 07 - . Qual o nome da cidade que possui a maior quantidade de restaurantes que fazem entregas?

In [28]:
df_aux = df.loc[df['is_delivering_now'] == 1, ['city', 'restaurant_id']].groupby('city').nunique().sort_values(by='restaurant_id').reset_index()
print(f'A cidade que possui a maior quantidade de restaurantes que fazem entregas é: {df_aux.iloc[-1,0]}')
df_aux

A cidade que possui a maior quantidade de restaurantes que fazem entregas é: Vadodara

            city  restaurant_id
0          Thane              1
1    Gandhinagar              1
2    Makati City              2
3          Noida              2
4          Nasik              2
5   Secunderabad              2
6           Doha              3
7      Panchkula              4
8            Goa              4
9        Gurgaon              4
10   Taguig City              5
11     Bangalore              9
12         Dubai             12
13        Mohali             13
14     Hyderabad             14
15       Sharjah             14
16       Chennai             16
17       Kolkata             17
18          Pune             18
19      Guwahati             18
20         Kochi             19
21     New Delhi             19
22        Mumbai             21
23          Ooty             22
24    Puducherry             22
25         Vizag             25
26     Abu Dhabi             26
27        Nashik             27
28     Mangalore             28
29        Mysore             28
30    Coimbatore             28
31         Patna             29
32  Bhubaneshwar             31
33         Surat             31
34     Allahabad             31
35    Chandigarh             33
36        Kanpur             35
37          Agra             36
38        Nagpur             37
39       Lucknow             38
40        Indore             40
41      Varanasi             40
42     Ahmedabad             41
43        Ranchi             42
44        Jaipur             42
45      Dehradun             45
46        Bhopal             46
47      Ludhiana             46
48    Aurangabad             47
49      Amritsar             48
50      Vadodara             48

## 08 - Qual o nome da cidade que possui a maior quantidade de restaurantes que aceitam pedidos online?

In [29]:
df_aux = df.loc[df['has_online_delivery'] == 1, ['city', 'restaurant_id']].groupby('city').nunique().sort_values(by='restaurant_id').reset_index()
print(f'A cidade que possui a maior quantidade de restaurantes que aceitam pedidos online é: {df_aux.iloc[-1,0]}')
df_aux

A cidade que possui a maior quantidade de restaurantes que aceitam pedidos online é: Bhopal

            city  restaurant_id
0       Zirakpur              1
1      Ghaziabad              1
2    Gandhinagar              1
3          Nasik              2
4    Makati City              3
5          Thane              3
6        Gurgaon              4
7          Noida              4
8   Secunderabad              5
9      Panchkula              6
10   Taguig City              6
11           Goa             10
12        Mohali             15
13     New Delhi             35
14          Doha             37
15     Bangalore             38
16    Puducherry             38
17      Guwahati             39
18          Ooty             40
19    Chandigarh             43
20        Nashik             46
21        Mumbai             48
22          Pune             49
23     Hyderabad             57
24         Vizag             57
25         Kochi             58
26       Chennai             59
27        Mysore             60
28       Lucknow             60
29      Dehradun             61
30        Indore             62
31       Kolkata             63
32         Dubai             63
33     Ahmedabad             63
34      Amritsar             63
35     Mangalore             64
36        Jaipur             64
37         Surat             64
38  Bhubaneshwar             66
39      Ludhiana             66
40        Kanpur             67
41      Varanasi             67
42          Agra             67
43    Coimbatore             68
44     Allahabad             68
45         Patna             69
46        Ranchi             69
47    Aurangabad             69
48        Nagpur             69
49       Sharjah             71
50     Abu Dhabi             71
51      Vadodara             74
52        Bhopal             75

# Fome Zero - Restaurantes

## 01 - Qual o nome do restaurante que possui a maior quantidade de avaliações?

In [30]:
df_aux = df.loc[:, ['restaurant_name', 'votes']].groupby('restaurant_name').sum().sort_values(by='votes').reset_index()
print(f'O restaurante que possui a maior quantidade de avaliaçÕes é: {df_aux.iloc[-1,0]}')
df_aux

O restaurante que possui a maior quantidade de avaliaçÕes é: Domino's Pizza

                restaurant_name  votes
0              Cantinho da Gula      0
1          Vinheria Santa Clara      0
2             Alston Bar & Beef      0
3            Coco Bambú Anhembi      0
4                       Barbosa      0
...                         ...    ...
5894                   Paradise  38283
5895                   Bawarchi  41711
5896            Barbeque Nation  53200
5897  AB's - Absolute Barbecues  58875
5898             Domino's Pizza  59749

[5899 rows x 2 columns]

## 02 - Qual o nome do restaurante com a maior nota média?

In [31]:
df_aux = df.loc[:, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').max().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante que possui a maior nota média é: {df_aux.iloc[-1,0]}')
df_aux

O restaurante que possui a maior nota média é: Buddakan

              restaurant_name  aggregate_rating
0     Le Bistrot du Cuisinier               0.0
1                        Nosu               0.0
2              Wachipa Corner               0.0
3                  Chai Chun                0.0
4     Le Delicatezze Di Bruno               0.0
...                       ...               ...
5894          Regina Pizzeria               4.9
5895         Home Slice Pizza               4.9
5896               Nobu Perth               4.9
5897                  Hitchki               4.9
5898                 Buddakan               4.9

[5899 rows x 2 columns]

## 03 - Qual o nome do restaurante que possui o maior valor de uma prato para duas pessoas?

In [32]:
df_aux = df.loc[:, ['restaurant_name', 'average_cost_for_two']].groupby('restaurant_name').max().sort_values('average_cost_for_two').reset_index()
print(f'O restaurante que possui o maior valor de um prato para duas pessoas é: {df_aux.iloc[-1,0]}')
df_aux

O restaurante que possui o maior valor de um prato para duas pessoas é: d'Arry's Verandah Restaurant

                   restaurant_name  average_cost_for_two
0                    Kaifak Burger                     0
1                Dishoom Edinburgh                     0
2                           Madero                     0
3                           Rofuto                     0
4                       Wok n Roll                     0
...                            ...                   ...
5894           Shabu-Shabu Shaburi                600000
5895                          SKYE                600000
5896          GIA Restaurant & Bar                700000
5897        The Café - Hotel Mulia               1200000
5898  d'Arry's Verandah Restaurant              25000017

[5899 rows x 2 columns]

## 04 - Qual o nome do restaurante de tipo de culinária brasileira que possui a menor média de avaliação?

In [33]:
df_aux = df.loc[df['cuisines'] == 'Brazilian', ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').min().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante que possui a menor média de avaliação é: {df_aux.iloc[0,0]}')
df_aux

O restaurante que possui a menor média de avaliação é: Restaurante dos Amigos

           restaurant_name  aggregate_rating
0   Restaurante dos Amigos               0.0
1       Loca Como tu Madre               0.0
2         Cantinho da Gula               0.0
3         Capricho Mineiro               0.0
4       Tempero das Gerais               0.0
..                     ...               ...
59         Texas De Brazil               4.8
60            Fogo de Chão               4.8
61       Braseiro da Gávea               4.9
62               Aprazível               4.9
63   Ola Brasil Restaurant               4.9

[64 rows x 2 columns]

## 05 - Qual o nome do restaurante de tipo de culinária brasileira, e que é do Brasil, que possui a maior média de avaliação?

In [34]:
linhas_selecionadas = ((df['cuisines'] == 'Brazilian') & (df['country_name'] == 'Brazil'))
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').max().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante brasileiro, de culinária brasileira, que possui a maior média de avaliação é: {df_aux.iloc[-1,0]}')
df_aux

O restaurante brasileiro, de culinária brasileira, que possui a maior média de avaliação é: Aprazível

               restaurant_name  aggregate_rating
0                   Rancho Inn               0.0
1             Famiglia Rivitti               0.0
2           Inácia Poulet Rôti               0.0
3                     Quitéria               0.0
4             Capricho Mineiro               0.0
5             Cantinho da Gula               0.0
6           Loca Como tu Madre               0.0
7         Galeteria Beira Lago               0.0
8                     Severina               0.0
9                  Café Savana               0.0
10                     Barbosa               0.0
11       Bar do Luiz Fernandes               0.0
12      Restaurante dos Amigos               0.0
13  NAVE MÃE FAST FOOD GOURMET               0.0
14          Tempero das Gerais               0.0
15           Café das Estrelas               3.0
16                  Liv Lounge               3.3
17     Confraria Chico Mineiro               3.3
18                       Maori               3.6
19             Bierfass Pontão               3.7
20         Botequim Cachambeer               3.9
21                    Mocellin               4.0
22            Camarada Camarão               4.1
23                  Leme Light               4.1
24             Santo Scenarium               4.2
25                   Monchique               4.2
26             Gaia Art & Cafe               4.2
27                         Oro               4.3
28         Academia da Cachaça               4.3
29                Café do Alto               4.3
30                Filé de Ouro               4.4
31                     Paribar               4.4
32                      Stalos               4.4
33            Bar da Dona Onça               4.4
34             Boteco Belmonte               4.4
35                 Marisqueira               4.4
36                Dalva e Dito               4.4
37                     Estadão               4.4
38                    Insalata               4.4
39            Casa da Feijoada               4.4
40              Bar do Mineiro               4.5
41                    Bar Urca               4.5
42          Giuseppe Grill Mar               4.5
43              Esquina Mocotó               4.5
44                      Veloso               4.6
45                  Balada Mix               4.6
46        Zazá Bistrô Tropical               4.7
47           Aconchego Carioca               4.7
48           Garota de Ipanema               4.8
49                      Mocotó               4.8
50                Fogo de Chão               4.8
51           Braseiro da Gávea               4.9
52                   Aprazível               4.9

## 06 - Os restaurantes que aceitam pedido online são também, na média, os restaurantes que mais possuem avaliações registradas?

In [35]:
df_aux = df[['has_online_delivery', 'votes']].groupby('has_online_delivery').mean()
print(f'A média de avaliaçÕes dos restaurantes que aceitam pedidos online é de: {df_aux.iloc[1,0]}')

print(f'A média de avaliaçÕes dos restaurantes que não aceitam pedidos online é de: {df_aux.iloc[0,0]}')

A média de avaliaçÕes dos restaurantes que aceitam pedidos online é de: 838.8216639209226
A média de avaliaçÕes dos restaurantes que não aceitam pedidos online é de: 479.63347410535675

## 07 - Os restaurantes que fazem reservas são também, na média, os restaurantes que possuem o maior valor médio de um prato para duas pessoas?

In [36]:
df_aux = df[['has_table_booking', 'average_cost_for_two']].groupby('has_table_booking').mean()
print(f'A média de avaliaçÕes dos restaurantes que aceitam reservas é de: {df_aux.iloc[1,0]}')

print(f'A média de avaliaçÕes dos restaurantes que não aceitam reservas é de: {df_aux.iloc[0,0]}')
df_aux

A média de avaliaçÕes dos restaurantes que aceitam reservas é de: 69998.42380952381
A média de avaliaçÕes dos restaurantes que não aceitam reservas é de: 3489.632242200707

                   average_cost_for_two
has_table_booking
0                           3489.632242
1                          69998.423810

## 08 - Os restaurantes do tipo de culinária japonesa dos Estados Unidos da América possuem um valor médio de prato para duas pessoas maior que as churrascarias americanas (BBQ)?

In [37]:
# Jeito mais enxuto da monitoria
linhas_selecionadas = df[(df['country_name'] == 'United States of America') & ((df['cuisines'] == 'BBQ') | (df['cuisines'] == 'Japanese'))]

df_aux = aux[['cuisines', 'average_cost_for_two']].groupby('cuisines').mean()

print(f'O valor médio de um prato japonês para 2 pessoas nos EUA é de: {df_aux.iloc[1,0]}')

print(f'O valor médio de um prato BBQ para 2 pessoas nos EUA é de: {df_aux.iloc[0,0]}')
# utilizar o chatgpt pra enxugar código

NameError: name 'aux' is not defined

# Fome Zero - Tipos de Culinária

## 01 - Dos restaurantes que possuem o tipo de culinária italiana, qual o nome do restaurante com a maior média de avaliação?

In [41]:
# Selecionando restaurantes com a cozinha 'Brazilian'
linhas_selecionadas = (df['cuisines'] == 'Brazilian')
df_aux = df.loc[linhas_selecionadas, ['restaurant_id', 'aggregate_rating', 'restaurant_name']].groupby(['restaurant_id', 'restaurant_name']).mean().sort_values(by='aggregate_rating').reset_index()
maior_nota = df_aux['aggregate_rating'].max()

# Selecionando os que tem nota igual a maior
linhas_selecionadas = (df_aux['aggregate_rating'] == maior_nota)

# Ordenando por ID
df_aux = df_aux.loc[linhas_selecionadas, :].sort_values(by='restaurant_id')

# Selecionando o restaurante mais antigo
print(f'O restaurante italiano com a maior média é o: {df_aux.iloc[0,1]}')
df_aux

O restaurante italiano com a maior média é o: Braseiro da Gávea

    restaurant_id        restaurant_name  aggregate_rating
69        7300955      Braseiro da Gávea               4.9
71        7302898              Aprazível               4.9
70       18403563        Texas de Brazil               4.9
72       18667552  Ola Brasil Restaurant               4.9

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Italian')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante italiano com a maior média é o: {df_aux.iloc[-1,0]}')
df_aux

## 02 -  Dos restaurantes que possuem o tipo de culinária italiana, qual o nome do restaurante com a menor média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Italian')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante italiano com a menor média é o: {df_aux.iloc[0,0]}')
df_aux

## 03 - Dos restaurantes que possuem o tipo de culinária americana, qual o nome do restaurante com a maior média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'American')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a maior média é o: {df_aux.iloc[-1,0]}')
df_aux

## 04 - Dos restaurantes que possuem o tipo de culinária americana, qual o nome do restaurante com a menor média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'American')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a menor média é o: {df_aux.iloc[0,0]}')
df_aux

## 05 - Dos restaurantes que possuem o tipo de culinária árabe, qual o nome do restaurante com a maior média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Arabian')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a maior média é o: {df_aux.iloc[-1,0]}')
df_aux

## 06 - Dos restaurantes que possuem o tipo de culinária árabe, qual o nome do restaurante com a menor média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Arabian')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a menor média é o: {df_aux.iloc[0,0]}')
df_aux

## 07 - Dos restaurantes que possuem o tipo de culinária japonesa, qual o nome do restaurante com a maior média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Japanese')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a maior média é o: {df_aux.iloc[-1,0]}')
df_aux

## 08 - Dos restaurantes que possuem o tipo de culinária japonesa, qual o nome do restaurante com a menor média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Arabian')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a menor média é o: {df_aux.iloc[0,0]}')
df_aux

## 09 - Dos restaurantes que possuem o tipo de culinária caseira, qual o nome do restaurante com a maior média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Home-made')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a maior média é o: {df_aux.iloc[-1,0]}')
df_aux

## 10 - Dos restaurantes que possuem o tipo de culinária caseira, qual o nome do restaurante com a menor média de avaliação?

In [ ]:
linhas_selecionadas = (df['cuisines'] == 'Home-made')
df_aux = df.loc[linhas_selecionadas, ['restaurant_name', 'aggregate_rating']].groupby('restaurant_name').mean().sort_values(by='aggregate_rating').reset_index()
print(f'O restaurante estadunidense com a menor média é o: {df_aux.iloc[0,0]}')
df_aux

## 11 - Qual o tipo de culinária que possui o maior valor médio de um prato para duas pessoas?

In [ ]:
df_aux = df.loc[:, ['cuisines', 'average_cost_for_two']].groupby('cuisines').mean().sort_values('cuisines').reset_index()
print(f'O tipo de culinária que tem o maior valor médio de um prato para 2 pessoas é o: {df_aux.iloc[-1, 0]}')

## 12 - Qual o tipo de culinária que possui a maior nota média?

In [44]:
df_aux = df.loc[:, ['cuisines', 'aggregate_rating']].groupby('cuisines').mean().sort_values('cuisines').reset_index()
print(f'O tipo de culinária que tem a maior nota média é o: {df_aux.iloc[-1, 0]}')

O tipo de culinária que tem a maior nota média é o: Yum Cha

## 13 - Qual o tipo de culinária que possui mais restaurantes que aceitam pedidos online e fazem entregas?

In [ ]:
linhas_selecionadas = ((df['has_online_delivery'] == 1) & (df['is_delivering_now'] == 1))
df_aux = df.loc[linhas_selecionadas, ['cuisines', 'restaurant_id']].groupby('cuisines').count().sort_values('restaurant_id').reset_index()

print(f'O tipo de culinária que possui mais restaurantes que aceitam pedidos online e fazem entregas é: {df_aux.iloc[-1,0]}')
df_aux

In [42]:
df

,restaurant_id,restaurant_name,country_name,city,address,locality,longitude,latitude,cuisines,average_cost_for_two,currency,has_table_booking,has_online_delivery,is_delivering_now,price_range,aggregate_rating,rating_color,rating_text,votes
0,6310675,Mama Lou's Italian Kitchen,Philippines,Las Piñas City,"Block 1, Lot 36, Tropical Avenue Corner Tropic...",BF International,121.009787,14.447615,Italian,1100,Botswana Pula(P),1,0,0,expensive,4.6,darkgreen,Excellent,619
1,6314542,Blackbird,Philippines,Makati City,"Nielson Tower, Ayala Triangle Gardens, Salcedo...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.024562,14.556042,European,3100,Botswana Pula(P),0,0,0,gourmet,4.7,darkgreen,Excellent,469
2,6301293,Banapple,Philippines,Makati City,"Ayala Triangle Gardens, Salcedo Village, Makat...","Ayala Triangle Gardens, Salcedo Village, Makat...",121.023171,14.556196,Filipino,800,Botswana Pula(P),0,0,0,expensive,4.4,green,Very Good,867
3,6315689,Bad Bird,Philippines,Makati City,"Hole In The Wall, Floor 4, Century City Mall, ...","Century City Mall, Poblacion, Makati City",121.027708,14.565899,American,700,Botswana Pula(P),0,0,0,expensive,4.4,green,Very Good,858
4,6304833,Manam,Philippines,Makati City,"Level 1, Greenbelt 2, Ayala Center, Greenbelt,...","Greenbelt 2, San Lorenzo, Makati City",121.020380,14.552351,Filipino,700,Botswana Pula(P),0,0,0,expensive,4.7,darkgreen,Excellent,930
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6922,5912546,Eataly,Turkey,İstanbul,"Zorlu Center AVM, Köprü Katı, Levazım Mahalles...","Zorlu Center AVM, Levazım, Beşiktaş",29.017326,41.065322,Italian,300,Turkish Lira(TL),0,0,0,gourmet,4.3,green,Very Good,1367
6923,5913006,Tarihi Çınaraltı Aile Çay Bahçesi,Turkey,İstanbul,"Çengelköy Mahallesi, Çınaraltı Camii Sokak, No...",Çengelköy Merkez,29.052620,41.050280,Fast Food,45,Turkish Lira(TL),0,0,0,normal,4.5,darkgreen,Excellent,1172
6924,5923535,Boon Cafe & Restaurant,Turkey,İstanbul,"Çengelköy Mahallesi, Çengelköy Caddesi, Kara S...",Çengelköy Merkez,29.052623,41.050717,Restaurant Cafe,140,Turkish Lira(TL),0,0,0,gourmet,4.2,green,Very Good,1160
6925,5914190,Kanaat Lokantası,Turkey,İstanbul,"Sultantepe Mahallesi, Selmani Pak Caddesi, No ...",Üsküdar Merkez,29.016590,41.025741,Home-made,95,Turkish Lira(TL),0,0,0,expensive,4.0,green,Very Good,770
6926,5913508,Katibim,Turkey,İstanbul,"Mimar Sinan Mahallesi, Harem Sahilyolu, No 53,...",Üsküdar Merkez,29.010808,41.025501,Restaurant Cafe,150,Turkish Lira(TL),0,0,0,gourmet,4.2,green,Very Good,1141